{"id":63,"date":"2022-05-29T15:56:57","date_gmt":"2022-05-29T15:56:57","guid":{"rendered":"https://wp.dhd2023.dig-hum.de/?page_id=63"},"modified":"2023-01-05T09:22:42","modified_gmt":"2023-01-05T09:22:42","slug":"zeitschiene","status":"publish","type":"page","link":"https://wp.dhd2023.dig-hum.de/","title":{"rendered":"#DHd2023"},"content":{"rendered":"\n<h2 class=\"has-text-align-center wp-block-heading\">Luxemburg / Trier</h2>\n\n\n\n<div class=\"wp-block-group is-layout-flow\"><div class=\"wp-block-group__inner-container\">\n<div class=\"wp-block-group is-layout-flow\"><div class=\"wp-block-group__inner-container\">\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"875\" height=\"337\" src=\"/wp-content/uploads/2022/05/cropped-LOGO_DHD_2023-final.png\" alt=\"\" class=\"wp-image-13\" srcset=\"/wp-content/uploads/2022/05/cropped-LOGO_DHD_2023-final.png 875w, /wp-content/uploads/2022/05/cropped-LOGO_DHD_2023-final-300x116.png 300w, /wp-content/uploads/2022/05/cropped-LOGO_DHD_2023-final-768x296.png 768w\" sizes=\"(max-width: 875px) 100vw, 875px\" /></figure>\n</div></div>\n</div></div>\n\n\n\n<p></p>\n\n\n\n<h2 class=\"wp-block-heading\">Die Registrierung startet am 12.01.2023.</h2>\n\n\n\n<h3 class=\"wp-block-heading\">Weitere Informationen folgen in den kommenden Tagen auf unserer brandneuen Webseite!</h3>\n\n\n\n<p></p>\n\n\n\n<p>Ein wesentliches Element des Selbstverständnisses der Digital Humanities ist die Überzeugung, dass Forschung, Lehre und die wissenschaftliche Community grundsätzlich von Offenheit profitieren. Mit dem Tagungsmotto <em>Open Humanities, Open Culture</em> soll diese Überzeugung für die DH-Community und auch darüber hinaus sichtbar und explizit gemacht werden. Die Offenheit berührt alle Aspekte der wissenschaftlichen Praxis, sei es im Bereich der Daten (Open Data), der Software (Open Source), der Publikationen (Open Access), der Lehrmaterialien (Open Educational Resources) oder der fachlichen Selbstdefinition und Community (“Big Tent DH”).</p>\n\n\n\n<p>Das Tagungsmotto hat durch die anhaltenden Debatten zu Open Access, durch aktuelle Diskussionen um die Reproduzierbarkeit von Forschung bei Offenlegung von Daten und Code und nicht zuletzt durch die fortschreitenden Prozesse des Mainstreamings und der Ausdifferenzierung der Digital Humanities und der damit verbundenen disziplinären Selbstvergewisserung einen erheblichen Aktualitätsbezug. Mit Blick auf jüngere Entwicklungen im nationalen und europäischen Urheberrecht für die Wissenschaft, unter anderem mit Blick auf die Regelungen zum Text und Data Mining, hat das Thema auch eine rechtliche und wissenschaftspolitische Dimension. Das Schlagwort “Open Humanities” knüpft dabei an das etablierte und sehr breite Konzept der “Open Science” an, möchte aber auch eine Diskussion über die besonderen Bedingungen der Offenheit in den Geisteswissenschaften anregen. Diesen liegen nicht in erster Linie Messdaten oder Survey-Daten zugrunde, sondern digitale Repräsentationen kultureller Artefakte im weitesten Sinne, mit ihren ganz eigenen Chancen und Herausforderungen (theoretischer, praktischer und rechtlicher Art) in Bezug auf “Offenheit” auch als epistemische Tugend. Das Schlagwort “Open Culture” soll einerseits die enge Anbindung der Geisteswissenschaften an das kulturelle Leben eines Ortes und einer Zeit betonen, andererseits aber auch die Anschlussfähigkeit der grenzüberschreitend organisierten Konferenz an die Ausrichtungsorte der Universität Luxemburg und Universität Trier mit ihrem reichen und diversen Kulturerbe.</p>\n","protected":false},"excerpt":{"rendered":"<p>Luxemburg / Trier Die Registrierung startet am 12.01.2023. Weitere Informationen folgen in den kommenden Tagen auf unserer brandneuen Webseite! Ein wesentliches Element des Selbstverständnisses der Digital Humanities ist die Überzeugung, dass Forschung, Lehre und die wissenschaftliche Community grundsätzlich von Offenheit profitieren. Mit dem Tagungsmotto Open Humanities, Open Culture soll diese Überzeugung für die DH-Community und [&hellip;]</p>\n","protected":false},"author":6,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"templates/template-cover.php","meta":{"_links_to":"","_links_to_target":""},"acf":[],"_links":{"self":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/pages/63"}],"collection":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/pages"}],"about":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/types/page"}],"author":[{"embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/users/6"}],"replies":[{"embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/comments?post=63"}],"version-history":[{"count":22,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/pages/63/revisions"}],"predecessor-version":[{"id":675,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/pages/63/revisions/675"}],"wp:attachment":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/media?parent=63"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]}}