[{"id":345,"date":"2022-11-30T14:31:58","date_gmt":"2022-11-30T14:31:58","guid":{"rendered":"https://wp.dhd2023.dig-hum.de/?p=345"},"modified":"2023-01-26T10:44:40","modified_gmt":"2023-01-26T10:44:40","slug":"opening-keynote","status":"publish","type":"post","link":"https://wp.dhd2023.dig-hum.de/index.php/2022/11/30/opening-keynote/","title":{"rendered":"Opening keynote"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full\"><img decoding=\"async\" loading=\"lazy\" width=\"648\" height=\"500\" src=\"/wp-content/uploads/2023/01/Sebastian_Majstorovic__Quinn_Dombrowski.jpg\" alt=\"Sebastian Majstorovic &amp; Quinn Dombrowski\" class=\"wp-image-769\" srcset=\"/wp-content/uploads/2023/01/Sebastian_Majstorovic__Quinn_Dombrowski.jpg 648w, /wp-content/uploads/2023/01/Sebastian_Majstorovic__Quinn_Dombrowski-300x231.jpg 300w\" sizes=\"(max-width: 648px) 100vw, 648px\" /><figcaption class=\"wp-element-caption\"><h4><a href=\"https://www.linkedin.com/in/quinndombrowski/\" target=\"_blank\" rel=\"noreferrer noopener\">Quinn Dombrowski</a> &amp; Sebastian Majstorovic</h4></figcaption></figure>\n\n\n<p>14.03.2023</p>\n<p>Belval / Luxembourg</p>\n<h3>&#8220;Open Culture meets Digital Activism: Saving Ukrainian Cultural Heritage Online (SUCHO)&#8221;<br />Sebastian Majstorovic &amp; Quinn Dombrowski</h3>\n<h4><b>Abstract</b></h4>\n<p>The Russian invasion of Ukraine has put cultural heritage right in the line of fire. Saving Ukrainian Cultural Heritage Online (SUCHO) is an online grassroots initiative of more than 1,500 volunteers which supports the digital preservation of Ukrainian culture. SUCHO started as an emergency web-archiving effort, preserving more than 50TB of cultural data from over 5,000 websites of Ukrainian museums, libraries and archives. In recent months, SUCHO, has expanded its efforts to donating digitisation hardware to Ukrainian institutions and creating online platforms for the preservation and exhibition of digitised and born-digital heritage. In this keynote, two of the SUCHO co-founders, Sebastian Majstorovic and Quinn Dombrowski, will discuss what it takes to turn remote volunteers into digital activists. Furthermore, the speakers will outline the crucial role Open Access plays for the digital preservation of culture in emergency scenarios such as wars and natural disasters.</p>\n<h4><b>Bio Quinn</b></h4>\n<p>Quinn Dombrowski is the Academic Technology Specialist in the Division of Literatures, Cultures, and Languages, and in the Library, at Stanford University, and has been involved with the international digital humanities community since 2007. Quinn currently serves as the co-President of the Association for Computers and the Humanities (ACH), and is the co-founder of numerous digital humanities groups, including the Data-Sitters Club, a multilingual, feminist pedagogical project; DH-WoGeM for women and gender minorities in DH; and Saving Ukrainian Cultural Heritage Online (SUCHO).</p>\n<h4><b>Bio Sebastian</b></h4>\n<p>Sebastian Majstorovic is a Digital Historian and one of the co-founders of Saving Ukrainian Cultural Heritage Online (SUCHO). Sebastian studied History, Film Studies, and East European studies in London and is currently finishing his PhD in History at the European University Institute in Florence. Before he joined academia, Sebastian worked as a full-stack software developer. His fields of expertise are geospatial visualisation, audiovisual sources and content mining. Sebastian currently works as a freelance Digital Humanities consultant and as Digital Advisor to the ERC research project &#8220;CAPASIA &#8211; The Asian Origins of Global Capitalism&#8221;, which maps early modern trading posts in the Indian Ocean.</p>","protected":false},"excerpt":{"rendered":"<h4>Short Abstract</h4>\n<p>The Russian invasion of Ukraine has put cultural heritage right in the line of fire. Saving Ukrainian Cultural Heritage Online (SUCHO) is an online grassroots initiative of more than 1,500 volunteers which supports the digital preservation of Ukrainian culture. SUCHO started as an emergency web-archiving effort, preserving more than 50TB of cultural data from over 5,000 websites of Ukrainian museums, libraries and archives. In recent months SUCHO, has expanded its efforts to donating digitisation hardware to Ukrainian institutions and creating online platforms for the preservation and exhibition of digitised and born-digital heritage. In this keynote, two of the SUCHO co-founders, Sebastian Majstorovic and Quinn Dombrowski, will discuss what it takes to turn remote volunteers into digital activists. Furthemore, the speakers will outline the crucial role Open Access plays for the digital preservation of culture in emergency scenarios such as wars and natural disasters.</p>\n","protected":false},"author":7,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[11],"tags":[],"acf":{"social_link":"https://twitter.com/quinnanya"},"_links":{"self":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/posts/345"}],"collection":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/posts"}],"about":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/types/post"}],"author":[{"embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/users/7"}],"replies":[{"embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/comments?post=345"}],"version-history":[{"count":27,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/posts/345/revisions"}],"predecessor-version":[{"id":860,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/posts/345/revisions/860"}],"wp:attachment":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/media?parent=345"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/categories?post=345"},{"taxonomy":"post_tag","embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/tags?post=345"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]}},{"id":241,"date":"2022-11-29T12:52:39","date_gmt":"2022-11-29T12:52:39","guid":{"rendered":"https://wp.dhd2023.dig-hum.de/?p=241"},"modified":"2023-01-16T08:57:43","modified_gmt":"2023-01-16T08:57:43","slug":"closing-keynote","status":"publish","type":"post","link":"https://wp.dhd2023.dig-hum.de/index.php/2022/11/29/closing-keynote/","title":{"rendered":"Closing keynote"},"content":{"rendered":"\n<figure class=\"wp-block-image size-full is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"/wp-content/uploads/2022/11/Jennifer-Edmond-1.jpg\" alt=\"Jennifer Edmond\" class=\"wp-image-246\" width=\"750\" height=\"500\" srcset=\"/wp-content/uploads/2022/11/Jennifer-Edmond-1.jpg 1000w, /wp-content/uploads/2022/11/Jennifer-Edmond-1-300x200.jpg 300w, /wp-content/uploads/2022/11/Jennifer-Edmond-1-768x511.jpg 768w\" sizes=\"(max-width: 750px) 100vw, 750px\" /><figcaption class=\"wp-element-caption\">Jennifer Edmond</figcaption></figure>\n\n\n<p>17.03.2023</p>\n<p>Trier</p>\n<h3>Open Science and the (Digital) Humanities: Open to our Past, Open to our Present, Open to our Future</h3>\n<h4><b>Abstract</b></h4>\n<p>Ever since the European Commission launched its landmark commitment to delivering Open Science for Europe in 2016, humanists have found themselves at the metaphorical centre of discussions about Open Science, while their actual concerns have seemed hardly recognisable in the discussions. This keynote address will trace the milestones of the past seven years in the development of the position of the humanities in the development of Open Science in Europe. I particular, it will focus on how the humanities, and in particular the digital humanities, might leverage their disciplinary traditions, established epistemic culture and emerging approaches to not just find a place within the open scientific paradigm, but to inform best practices for how it might better serve all disciplines.</p>\n<h4><b>Bio</b></h4>\n<p>Dr Jennifer Edmond, is Associate Professor of Digital Humanities in the School of Languages, Literatures and Cultural Studies at Trinity College Dublin. She is also the co-director of the Trinity Center for Digital Humanities, and Director of Trinity&#8217;s MPhil in Digital Humanities and Culture. She holds a PhD in Germanic Languages and Literatures from Yale University, and applies her training as a scholar of language, narrative and culture to the study and promotion of advanced methods in and infrastructures for the arts and humanities.</p>\n<p>In this vein, she has developed a significant profile in European research and research policy circles in the past 5 years, having been named one of Ireland’s five “Champions of EU Research” in 2012. She coordinated the €6.5m CENDARI FP7 (2012-1026) project and is a partner in the related infrastructure cluster, PARTHENOS. Her other EU projects have included coordinating Researcher Night in 2013, Europeana Cloud, the ESF Network NeDiMAH, the ICT ‘sister project’ Knowledge Complexity (KPLEX) and also PROVIDEDH (CHIST-ERA) project. In 2023, she will launch a new Horizon-Europe-funded project, Knowledge Technologies for Technology (or KT4D).</p>\n<p>Jennifer is a former President of the Board of Directors of the pan-European research infrastructure for the arts and humanities, DARIAH. Additionally she represented this body on the Open Science Policy Platform (OSPP), which supports the European Commission in developing and promoting Open Science policies. Although her term as DARIAH Director has ended, she continues to represent DARIAH on the Governing Board of EASSH, the European Association of Social Sciences and Humanities.</p>\n<p>Jennifer has played a leadership role in numerous strategic developments at national and institutional level, and has lent her expertise in the development of infrastructure to a wide variety of initiatives and agencies, from the food manufacturing industry through to the Korean national maritime agency. She is also a strong proponent of public outreach for academic research, having presented her work to general audiences, live as well as through radio, television and video, and even through the medium of stand-up comedy.</p>","protected":false},"excerpt":{"rendered":"<h4>Short Abstract</h4>\n<p>Ever since the European Commission launched its landmark commitment to delivering Open Science for Europe in 2016, humanists have found themselves at the metaphorical centre of discussions about Open Science, while their actual concerns have seemed hardly recognisable in the discussions. This keynote address will trace the milestones of the past seven years in the development of the position of the humanities in the development of Open Science in Europe.</p>\n","protected":false},"author":7,"featured_media":246,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_links_to":"","_links_to_target":""},"categories":[11],"tags":[],"acf":{"social_link":"https://twitter.com/jedmond36"},"_links":{"self":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/posts/241"}],"collection":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/posts"}],"about":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/types/post"}],"author":[{"embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/users/7"}],"replies":[{"embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/comments?post=241"}],"version-history":[{"count":20,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/posts/241/revisions"}],"predecessor-version":[{"id":835,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/posts/241/revisions/835"}],"wp:featuredmedia":[{"embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/media/246"}],"wp:attachment":[{"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/media?parent=241"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/categories?post=241"},{"taxonomy":"post_tag","embeddable":true,"href":"https://wp.dhd2023.dig-hum.de/index.php/wp-json/wp/v2/tags?post=241"}],"curies":[{"name":"wp","href":"https://api.w.org/{rel}","templated":true}]}}]